app.controller('ResearchActivitiesController', ['$scope', function ($scope) {
    var init = function () {
        $scope.targets = [
            "Оптимізація сучасних інформаційних технологій. Зокрема, розробка оптимальних схем доступу до інформації файлів баз даних для однопроцесорних і багатопроцесорних систем, оптимальний розподіл інформаційних і обчислювальних ресурсів серед вузлів комп'ютерних мереж, розробка нових ефективних методів пошуку інформації в великих базах даних тощо.",
            "Математичне і комп'ютерне моделювання та прогнозування природничих і економічних процесів. Зокрема, математичне та комп'ютерне моделювання  процесів поширення забруднення в навколишньому середовищі, забруднення в поверхневих водах, математичне моделювання напружено-деформованого стану дентальних систем \"коронка- імплантат-кісткова тканина\" тощо.",
            "Використання апарату некласичних мажорант і діаграм Ньютона функцій, заданих таблично, для розробки чисельних методів розв'язування окремих задач алгебри, математичного аналізу, диференціальних рівнянь."
        ];
    }

    init();
}])